FirstRouterandController/app/models/art_work.rb

  def self.artworks_for_user_id(id) #id = user_id/artist_id
    art_work = ArtWork.joins(:artwork_shares).left_outer_joins(:artist).where('artist_id = (?) OR artwork_shares.viewer_id = (?)', id, id).distinct
---
SELECT "art_works"."id" FROM "art_works" INNER JOIN "artwork_shares" ON "artwork_shares"."art_work_id" = "art_works"."id" INNER JOIN "users" ON "users"."id" = "art_works"."artist_id" WHERE (artist_id = ('1') AND artwork_shares.viewer_id = ('1')) ORDER BY "art_works"."id" ASC LIMIT $1  [["LIMIT", 1]]