FirstRouterandController/app/controllers/art_works_controller.rb

SELECT "art_works"."id" FROM "art_works" INNER JOIN "artwork_shares" ON "artwork_shares"."art_work_id" = "art_works"."id" INNER JOIN "users" ON "users"."id" = "art_works"."artist_id" WHERE (artist_id = ('1') AND artwork_shares.viewer_id = ('1')) LIMIT $1  [["LIMIT", 11]]
SELECT "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def index
      # debugger
      param = params[:user_id]
      incoming_wildcard = ArtWork.artworks_for_user_id(param)
      # debugger
      arts = ArtWork.find(incoming_wildcard.first)
      arts_share = ArtworkShare.find(incoming_wildcard.first)