FirstRouterandController/app/controllers/art_works_controller.rb

SELECT "art_works".* FROM "art_works"
---
    def index
        render json: ArtWork.all