FirstRouterandController/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
SELECT "users".* FROM "users" WHERE (username LIKE ('PabloPicaso'))
---
  def index
    param = params[:query]
    if param.nil?
      render json: User.all
    else
      render json: User.where('username LIKE (?)', param)

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Poppy"], ["email", "poppy@gmail.com"], ["created_at", "2023-03-09 00:37:56.975907"], ["updated_at", "2023-03-09 00:37:56.975907"]]
---
  def create
    user = User.new(user_params)

    if user.save!

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def show
    incoming_wildcard = params[:id]
    user = User.find(incoming_wildcard)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "abby"], ["email", "dchavez@gmail.com"], ["updated_at", "2023-03-09 00:51:47.988658"], ["id", 4]]
---
  def update
    user = User.find_by(id: params[:id])

    if user && user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 3]]
---
  def destroy
    incoming_wildcard = params[:id]
    user = User.find(incoming_wildcard)
    user.destroy